package days08;

public class Ex06 {

	public static void main(String[] args) {
		/*
		 * [배열 Array]
		 * 1. 참조형 - 배열, 클래스, 인터페이스
		 * 2. [] 인덱스(index) 연산자 설명
		 * 1000명의 국어 점수를 저장할 변수를 선언.
		 * int kor1; --> 너무 많음
		 * 3.동일한 자료형을 메모리상에 연속적으로 놓이게 한 것을 배열이라고 한다. 
		 * 4.int [] kors = new int [1000]; 배열선언
		 *          변수
		 *          지역변수
		 *          참조변수
		 *          배열명
		 *          
		 * 5. 배열 그림 기억하기
		 * 힙                           
		 * [][][][]
		 * 시작주소         
		 * 참조타입                 
		 * 6. 0번째 요소 아랫첨자값
		 * .
		 * .
		 * .
		 * 999번쨰 요소 윗첨자값
		 * 첨자값
		 * index     
		 * 
		 *     7. 배열명 length - 1 ==윗첨자값 upperBound
		 *     
		 *    8. 배열을 초기화 하지 않으면 자동으로 초기화 되어져있다. 
		 *    9. 
		 */
		
		
		
		
		
		
		
		
		
		
	}//main

}//class
