package days11;

public class Ex01 {

	public static void main(String[] args) {
		/* 1. 객체지향 프로그래밍 
		 *   (Object Oriented Programming : OOP)
		 *    ㄴ 객체+객체......객체들을 만들고 조립해서 프로그래밍하는 기법
		 * 2.객체 (Object) : 물리적, 개념적으로 존재 하는 것들 중 다른것과 식별가능 한 것. 
		 * 3. 객체 -> 속성(필드)과 동작(메소드)으로 구성
		 *            특징          일,기능
		 * 
		 * 
		 * ex) 완성된 컴퓨터 조립 = 부품+부품+부품+부품+...
		 *                 설계도
		 *  
		 *        소프트웨어 조립 = 객체 + 객체 + ..
		 *                 클래스
		 *        
		 * 4. 객체(클래스) 간의 관계 
		 * 1) 집합관계 - 자동차와 엔진
		 * 2) 상속관계 -필드와 메소드
		 * 
		 * 5.OOP의 특징 (클래스의 특징)
		 * 1. 캡슐화
		 *   (은닉화)
		 * 2. 상속성
		 * 3.  * 다형성 
		 * 4. 추상화
		 * 
		 * 6. 클래스: 객체의 설계도 
		 * 7.인스턴스: 클래스를 보고 생성한 객체. (인스턴스화)
		 * 
		 * calc.exe 실행파일 / 프로세스(실행중인 프로그램 -개수 제한 x)
		 * 
		 * 8. 클래스 선언
		 *    ㄴ 필드 + 메소드 선언 
		 *    ㄴ Sample.java == Sample 클래스명                        상속                   다형성
		 *    ㄴ클래스 선언형식: [접근지정자] [기타제어자] class 클래스명[extends 부모클래스][implements 인터페이스]{ 멤버 == 객체(클래스)의 구성요소)
		 *    
		 *                            +  = modifiers(제한자)                                             필드 (==멤버변수) , 속성(특징)
		 *                                                                                             메소드 (==멤버함수), 동작(기능,일)
		 *                                                                                             생성자 
		 *                                                                                             
		 * 9. 객체 모델링 (Object Modeling) : 현실 세계의 존재하는 것을 소프트웨어로 설계하는 것. (과정)
		 * 
		 * 10. 클래스 설계하는 과정
		 * 1) 객체 구성요소(속성, 동작) 파악 -> 목록 작성
		 *     스포츠카 : 운전석과 조수석으로 구성, 엔진은 어느 속도로? , 차제 등등  
		 * 2) 객체 모델링 - 필드,메서드 작성 
		 * 3) 클래스 선언 
		 * 4) 객체 생성 - 테스트 
		 * 5) 문제점 파악 - 유지보수 작업
		 * 6) 상용화
		 * 7) 기능추가, 문제점 파악(소비자 피드백)-> 유지보수작업, 연도에 따른 버전 관리
		 * 
		 * 11. 신형 자동차 클래스 설계. 
		 * Car.java 
		 * 
		 * 12. 필드선언- 초기화 하지 않아도 객체가 생성될때 기본값으로 초기화. 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 * 
		 */
		
		

	}

}
